{
  "ribbon": {
    "title": "Publications",
    "description": "Explore our research contributions to the scientific community through peer-reviewed publications, conference papers, and technical reports."
  },
  "publications": [
    {
      "card": {
        "thumbnail": "images/Pub_Journal_JAP_2025.jpg",
        "card-heading": "A physics-aware deep learning model for shear band formation around collapsing pores in shocked reactive materials",
        "author-name": "Cheng, X., Chen, B., Choi, J., Nguyen, Y.T., Seshadri, P. K., Verma, M., Udaykumar, H.S. and Baek, S.",
        "year": "2025",
        "citation": "0 citations",
        "tags": ["Physics-informed machine learning", "Physics-aware recurrent convolutional neural networks", "Data-driven modeling"],
        "category": "Journal",
        "publication-title": "Journal of Applied Physics",
        "description": "Modeling shock-to-detonation phenomena in energetic materials (EMs) requires capturing complex physical processes such as strong shocks, rapid changes in microstructural morphology, and nonlinear dynamics of chemical reaction fronts. These processes participate in energy localization at hotspots, which initiate chemical energy release leading to detonation. This study addresses the formation of hotspots in crystalline EMs subjected to weak-to-moderate shock loading, which, despite its critical relevance to the safe storage and handling of EMs, remains underexplored compared to the well-studied strong shock conditions. To overcome the computational challenges associated with direct numerical simulations, we advance the Physics-Aware Recurrent Convolutional Neural Network (PARCv2), which has been shown to be capable of predicting strong shock responses in EMs. We improved the architecture of PARCv2 to rapidly predict shear localizations and plastic heating, which play important roles in the weak-to-moderate shock regime. PARCv2 is benchmarked against two widely used physics-informed models, namely, Fourier neural operator and neural ordinary differential equation; we demonstrate its superior performance in capturing the spatiotemporal dynamics of shear band formation. While all models exhibit certain failure modes, our findings underscore the importance of domain-specific considerations in developing robust AI-accelerated simulation tools for reactive materials.",
        "doi": "https://doi.org/10.1063/5.0294397",
        "view-link": "https://pubs.aip.org/aip/jap/article/138/14/145105/3366892",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_1_IJMF_2024.jpg",
        "card-heading": "Physics-aware recurrent convolutional neural networks for modeling multiphase compressible flows.",
        "author-name": "Cheng, X., Nguyen, P. C. H., Seshadri, P. K., Verma, M. Gray, Z., Beerman, J., Udaykumar, H.S., and Baek, S.",
        "year": "2024",
        "citation": "12 citations",
        "tags": ["Physics-informed machine learning", "Physics-aware recurrent convolutional neural networks", "Data-driven modeling"],
        "category": "Journal",
        "publication-title": "International Journal of Multiphase Flow",
        "description": "Multiphase compressible flow systems can exhibit unsteady and fast-transient dynamics, marked by sharp gradients and discontinuities, and material boundaries that interact with the evolving flow. The transient nature of the dynamics presents challenges to employing artificial intelligence (AI) and data-driven models for predicting flow behaviors. In this study, we explore the potential of physics-aware recurrent convolutional neural networks (PARC) to model the spatiotemporal dynamics of multiphase flows in the presence of shocks and reaction fronts. PARC is a neural network model that incorporates the generic form of the diffusion–advection–reaction equation in its network architecture, which mimics the process of solving the governing equations of fluid flows. In contrast to physics-informed machine learning approaches such as physics-informed neural networks (PINNs) where models are trained to directly minimize the residual of governing equations, PARC takes a dynamical systems viewpoint and does not seek to minimize potentially nonconvex and nonlinear loss terms. To assess the ability of PARC to accurately learn and simulate the physics of multiphase flows, we train and test PARC on various flow simulation problems, including the Burgers’ equation, fluid flow behind a cylindrical cross-section, and unsteady shock interactions with a particle at varying Mach numbers. We analyze PARC’s performance and examine sources of error in its prediction, in terms of differentiation and integration schemes and different weighting strategies for the model update. Based on our observations, we discuss PARC’s capabilities and limitations in multiphase flow applications and propose future research directions.",
        "doi": "https://doi.org/10.1016/j.ijmultiphaseflow.2024.104877",
        "view-link": "https://www.sciencedirect.com/science/article/pii/S030193222400154X?via%3Dihub",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_2_JAP_2024.jpg",
        "card-heading": "Johnson-Cook yield functions for Cyclotetramethylene-tetranitramine (HMX) and Cyclotrimethylene-trinitramine (RDX) derived from single crystal plasticity models.",
        "author-name": "Sen, O., Seshadri, P. K., Rai, N.K., Larentzos, J., Brennan, J., Sewell, T., Picu, C.R., and Udaykumar, H. S.",
        "year": "2024",
        "citation": "12 citations",
        "tags": ["Molecular dynamics", "Speed of sound", "Stress measurement","Plasticity"," Shear modulus"],
        "category": "Journal",
        "publication-title": "Journal of Applied Physics",
        "description": "High-fidelity constitutive models are critical for accurate meso-scale continuum modeling and prediction of shock initiation of crystalline energetic materials (EMs). While empirically calibrated or atomistic-guided anisotropic elastoplastic models of EM such as cyclotetramethylene-tetranitramine (HMX) and cyclotrimethylene-trinitramine (RDX) capture important micromechanical phenomena (such as dislocation evolution, slip-resistance, and anisotropic elasticity), the computational cost of using anisotropic single-crystal plasticity models can become prohibitive for meso-scale computations of void-collapse and hotspot formation in microstructures. Thermo-mechanically representative, isotropic, pressure, temperature, and rate-dependent material constitutive models are practical alternatives for meso-scale simulations of the shock response of microstructures. To this end, this work constructs physically consistent isotropic plasticity from anisotropic single-crystal plasticity models for HMX and RDX. State-of-the-art crystal plasticity models for HMX and RDX are used to compute the stress states in single crystals oriented in three different directions relative to shocks generated by impact at velocities ranging from 100 to 1000 m/s. Post-shock von Mises stress fields for the three orientations are then used to calibrate the strain-rate hardening coefficient and the reference strain rate for a rate-dependent Johnson–Cook (JC) yield surface model. We compare the pressures and the post-shock von Mises stresses between the JC and the anisotropic models to show that the isotropic computations closely approximate the averaged deformation response of the three different crystal orientations. We then model the interaction of a shock generated by a 500 m/s impact with a 0.5 μm void and show that the pressures and the deviatoric stresses obtained using the isotropic model closely match those computed from anisotropic models for both HMX and RDX. The resulting isotropic J2 plastic flow model for HMX and RDX can be employed to perform meso-scale simulations for energy localization due to shear bands and void collapse in the two materials.",
        "doi": "https://doi.org/10.1063/5.0188263",
        "view-link": "https://pubs.aip.org/aip/jap/article/135/14/145901/3282000/Johnson-Cook-yield-functions-for",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_3_JAP_2023.jpg",
        "card-heading": "Physically evocative meso-informed sub-grid source term for energy localization in shocked heterogeneous energetic materials.",
        "author-name": "Nguyen, Y. T., Seshadri, P. K., and Udaykumar, H. S.",
        "year": "2023",
        "citation": "4 citations",
        "tags": ["Deformation", "Energetic materials", "Deflagration", "Multiscale methods"],
        "category": "Journal",
        "publication-title": "Journal of Applied Physics",
        "description": "Reactive burn models for heterogeneous energetic materials (EMs) must account for chemistry as well as microstructure to predict shock-to-detonation transition (SDT). Upon shock loading, the collapse of individual voids leads to ignition of hotspots, which then grow and interact to consume the surrounding material. The sub-grid dynamics of shock-void interactions and hotspot development are transmitted to macro-scale SDT calculations in the form of a global reactive “burn model.” This paper presents a physically evocative model, called meso-informed sub-grid source terms for energy localization (MISSEL), to close the macro-scale governing equations for calculating SDT. The model parameters are explicitly related to four measurable physical quantities: two depending on the microstructure (the porosity and average pore size ⁠), one depending on shock–microstructure interaction (the fraction of critical voids ⁠), and the other depending on the chemistry (the burn front velocity ⁠). These quantities are individually quantifiable using a small number of rather inexpensive meso-scale simulations. As constructed, the model overcomes the following problems that hinder the development of meso-informed burn models: (1) the opacity of more sophisticated surrogate/machine-learning approaches for bridging meso- and macro-scales, (2) the rather large number of high-resolution mesoscale simulations necessary to train machine-learning algorithms, and (3) the need for calibration of many free parameters that appear in phenomenological burn models. The model is tested against experimental data on James curves for a specific class of pressed 1,3,5,7-tetranitro-1,3,5,7-tetrazoctane materials. The simple, evocative, and fast-to-construct MISSEL model suggests a route to develop frameworks for physics-informed, simulation-derived meso-informed burn models.",
        "doi": "https://doi.org/10.1063/5.0165617",
        "view-link": "https://pubs.aip.org/aip/jap/article-abstract/134/16/165901/2918198/Physically-evocative-meso-informed-sub-grid-source?redirectedFrom=fulltext",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_4_SciAdv_2023.jpg",
        "card-heading": "PARC: Physics-aware recurrent convolutional neural networks to assimilate meso scale reactive mechanics of energetic materials.",
        "author-name": "Nguyen, P. C., Nguyen, Y. T., Choi, J. B., Seshadri, P. K., Udaykumar, H. S., & Baek, S. S. ",
        "year": "2022",
        "citation": "33 citations",
        "tags": ["Thermo-mechanical"],
        "category": "Journal",
        "publication-title": "Science Advances",
        "description": "The thermo-mechanical response of shock-initiated energetic materials (EMs) is highly influenced by their microstructures, presenting an opportunity to engineer EM microstructures in a “materials-by-design” framework. However, the current design practice is limited, as a large ensemble of simulations is required to construct the complex EM structure-property-performance linkages. We present the physics-aware recurrent convolutional (PARC) neural network, a deep learning algorithm capable of learning the mesoscale thermo-mechanics of EM from a modest number of high-resolution direct numerical simulations (DNS). Validation results demonstrated that PARC could predict the themo-mechanical response of shocked EMs with comparable accuracy to DNS but with notably less computation time. The physics-awareness of PARC enhances its modeling capabilities and generalizability, especially when challenged in unseen prediction scenarios. We also demonstrate that visualizing the artificial neurons at PARC can shed light on important aspects of EM thermos-mechanics and provide an additional lens for conceptualizing EM.",
        "doi": "https://www.science.org/doi/10.1126/sciadv.add6868",
        "view-link": "https://www.science.org/doi/10.1126/sciadv.add6868",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_5_PEP_2023.jpg",
        "card-heading": "A Physics‐Aware Deep Learning Model for Energy Localization in Multiscale Shock‐To‐Detonation Simulations of Heterogeneous Energetic Materials.",
        "author-name": "Nguyen, P. C., Nguyen, Y. T., Seshadri, P. K., Choi, J. B., Udaykumar, H. S., & Baek, S. S.",
        "year": "2023",
        "citation": "27 citations",
        "tags": ["physics-aware machine learning", "mesoscale energy localization", "shock-to-detonation","multiscale simaulation"],
        "category": "Journal",
        "publication-title": "Propellants, Explosives, Pyrotechnics",
        "description": "Predictive simulations of the shock-to-detonation transition (SDT) in heterogeneous energetic materials (EM) are vital to the design and control of their energy release and sensitivity. Due to the complexity of the thermo-mechanics of EM during the SDT, both macro-scale response and sub-grid mesoscale energy localization must be captured accurately. This work proposes an efficient and accurate multiscale framework for SDT simulations of EM. We introduce a new approach for SDT simulation by using deep learning to model the mesoscale energy localization of shock-initiated EM microstructures. The proposed multiscale modeling framework is divided into two stages. First, a physics-aware recurrent convolutional neural network (PARC) is used to model the mesoscale energy localization of shock-initiated heterogeneous EM microstructures. PARC is trained using direct numerical simulations (DNS) of hotspot ignition and growth within microstructures of pressed HMX material subjected to different input shock strengths. After training, PARC is employed to supply hotspot ignition and growth rates for macroscale SDT simulations. We show that PARC can play the role of a surrogate model in a multiscale simulation framework, while drastically reducing the computation cost and providing improved representations of the sub-grid physics. The proposed multiscale modeling approach will provide a new tool for material scientists in designing high-performance and safer energetic materials.",
        "doi": "https://doi.org/10.1002/prep.202200268",
        "view-link": "https://onlinelibrary.wiley.com/doi/full/10.1002/prep.202200268",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_6_JFS_2023.jpg",
        "card-heading": "Leading edge vortex dynamics in airfoils: Effect of pitching motion at large amplitudes.",
        "author-name": "Seshadri, P. K., Aravind, A., and De, A.",
        "year": "2023",
        "citation": "13 citations",
        "tags": ["Journal of Fluids"],
        "category": "Journal",
        "publication-title": "Journal of Fluids and Structures",
        "description": "Airfoils pitching in the stalled regime have been of keen interest in recent years due to their desirable aerodynamic force characteristics. This study numerically investigates the unsteady flow past a NACA (National Advisory Committee for Aeronautics) 0012 airfoil under sinusoidally pitching motion using a sharp interface immersed boundary framework. The flow is investigated in the low Reynolds number regime (Re = 3000) for reduced frequencies of 0.628 and 3.14 at three pivot locations (one-third chord, mid-chord, and two-third chord lengths from the leading edge). The airfoil is subjected to sinusoidal motion, with its incidence angle varying from 15° to 45°. Leading-edge vortices (LEVs) formed during the pitching motion dictate the transient aerodynamic characteristics. The flow field data is used to identify individual LEVs in the flow field. The spatio-temporal evolution of LEVs in terms of their strengths and vorticity weighted centroid is traced throughout the pitching cycle to obtain a quantitative estimate of their evolution. The cycle-to-cycle variation in the vorticity evolution is characterized, and its corresponding influence on the lift/drag characteristics has been explored in detail. At low frequencies, all the pitching cycles evolve in two different patterns; however, at high frequencies, the LEVs from different cycles merge and evolve in the form of a vortex cluster. The effect of pivot location and pitching frequency on the vortex evolution and aerodynamic forces is investigated. An increased pitching frequency delays LEV formation and drastically alters the vortex dynamics. The maximum values of the lift and drag coefficients increase with pitching frequency. Additionally, pivot locations have a stronger influence on the magnitude and phase of aerodynamic coefficients at higher frequencies. However, moving the pivot axis aftward at all studied frequencies delays LEV evolution and causes a phase lag on the aerodynamic forces.",
        "doi": "https://doi.org/10.2514/1.B38700",
        "view-link": "https://www.sciencedirect.com/science/article/abs/pii/S0889974622001888?via%3Dihub",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_7_JPP_2022.jpg",
        "card-heading": "Physically Evocative Meso-Informed Burn Model: Topology of Evolving Hotspot Fields.",
        "author-name": "Udaykumar, H. S., Nguyen, Y. T., and Seshadri, P. K. ",
        "year": "2022",
        "citation": "5 citations",
        "tags": ["Reactive burn models", "Heterogeneous energetic materials", "Shock-to-detonation transition"],
        "category": "Journal",
        "publication-title": "Journal of Propulsion and Power",
        "description": "Reactive burn models for heterogeneous energetic material initiation must account for chemistry as well as microstructure to predict shock-to-detonation transition. Upon transient (strong) shock loading, the collapse of individual voids leads to ignition of hotspots, which then grow and interact to completely consume the surrounding material. This paper shows that a length scale measuring the perimeter of the evolving burn front in a field of hotspots, in combination with a topological function/form factor for the hotspot field, is a key input to a framework for constructing a meso-informed reaction rate model. The approach suggested in this paper provides a route to constructing reaction rate models with only two quantities of interest, viz., the burn front perimeter and burn front velocity, which are physically evocative of the underlying hotspot physics and can be quantified individually using meso-scale simulations. It overcomes the problem of calibrating many free parameters that appear in phenomenological burn models and therefore suggests a route to developing general frameworks for simulation-derived meso-informed burn models.",
        "doi": "https://doi.org/10.1016/j.ijnonlinmec.2021.103766",
        "view-link": "https://arc.aiaa.org/doi/abs/10.2514/1.B38700",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_8_JAP_2022.jpg",
        "card-heading": "Multi-scale modeling of shock initiation of a pressed energetic material. II. Effect of void–void interactions on energy localization.",
        "author-name": "Nguyen, Y. T., Seshadri, P. K., Sen, O., Hardin, D. B., Molek, C. D., and Udaykumar, H. S. ",
        "year": "2022",
        "citation": "8 citations",
        "tags": ["Shock waves", "Energetic materials", "Multiscale methods"],
        "category": "Journal",
        "publication-title": "Journal of Applied Physics",
        "description": "Heterogeneous energetic materials (EMs) contain microstructural defects such as voids, cracks, interfaces, and delaminated zones. Under shock loading, these defects offer potential sites for energy localization, i.e., hotspot formation. In a porous EM, the collapse of one void can generate propagating blast waves and hotspots that can influence the hotspot phenomena at neighboring voids. Such void–void interactions must be accounted for in predictive multi-scale models for the reactive response of a porous EM. To infuse such meso-scale phenomena into a multi-scale framework, a meso-informed ignition and growth model (MES-IG) has been developed, where the influence of void–void interactions is incorporated into the overall reaction rate through a function,. Previously, MES-IG was applied to predict the sensitivity and reactive response of EM, where was assumed to be a function of the overall sample porosity alone. This paper performs a deeper analysis to model the strong dependency of on other factors, such as void size and shock strength. The improved model for void–void interactions produces good agreement with direct numerical simulations of the HE microstructures and, thus, advances the predictive capability of multi-scale models of the shock response and sensitivity of EM.",
        "doi": "https://doi.org/10.1063/5.0090225",
        "view-link": "https://pubs.aip.org/aip/jap/article/131/21/215903/2837072",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_9_JAP_2022.jpg",
        "card-heading": "Multi-scale modeling of shock initiation of a pressed energetic material I: The effect of void shapes on energy localization",
        "author-name": "Nguyen, Y. T., Seshadri, P. K., Sen, O., Hardin, D. B., Molek, C. D., and Udaykumar, H. S. ",
        "year": "2022",
        "citation": "26 citations",
        "tags": ["Micromechanics", "Energetic materials", "Computer simulation","Multiscale methods", "Chemical reaction dynamics"],
        "category": "Journal",
        "publication-title": "Journal of Applied Physics",
        "description": "Accurate simulations of the shock response of heterogeneous energetic (HE) materials require closure models, which account for energy localization in the micro-structure. In a multi-scale framework, closure is provided by reaction rate models that account for ignition and growth of hotspots, allowing for prediction of the overall macro-scale sensitivity of a HE material. In the present meso-informed ignition and growth (MES-IG) model, the reaction rate is expressed as a function of shock pressure and morphology of the void field in a pressed energetic material. In MES-IG, the void morphology is quantified in terms of a limited number of parameters: viz., overall porosity, void size, and shape (aspect ratio and orientation). In this paper, we quantify the effects of arbitrary variations in void shapes on meso-scale energy deposition rates. A collection of voids of arbitrary shapes is extracted from scanning electron microscope (SEM) images of real, pressed HMX (octahydro-1,3,5,7-tetranitro-1,3,5,7-tetrazocine) samples and classified into groups based on their similarity in shapes. Direct numerical simulations (DNS) are performed on the highly contorted “real” void shapes, and the calculated hotspot ignition and growth rates are compared with values predicted by the MES-IG. It is found that while the parameterization of complex void morphologies in terms of orientation and aspect ratio gives fairly good agreement between DNS and MES-IG reaction rates, the intricate details of highly complex void shapes impact hotspot characteristics to a significant extent. This work suggests possible improvements for the prediction of reaction rate in the energetic microstructure by adopting a more detailed description of shapes.",
        "doi": "https://doi.org/10.1063/5.0068715",
        "view-link": "https://pubs.aip.org/aip/jap/article-abstract/131/5/055906/2836570/Multi-scale-modeling-of-shock-initiation-of-a?redirectedFrom=fulltext",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_10_JAP_2022.jpg",
        "card-heading": "Meso-scale simulation of energetic materials. II. Establishing structure–property linkages using synthetic microstructures.",
        "author-name": "Seshadri, P. K., Nguyen, Y. T., Sen, O., and Udaykumar, H. S",
        "year": "2022",
        "citation": "12 citations",
        "tags": ["Artificial intelligence", "Machine learning", "Energetic materials", "Multiscale methods"],
        "category": "Journal",
        "publication-title": "Journal of Applied Physics",
        "description": "Meso-scale simulations of pressed energetic materials are performed using synthetic microstructures generated using deep feature representation, a deep convolutional neural network-based approach. Synthetic microstructures are shown to mimic real microstructures in the statistical representation of global and local features of micro-morphology for three different classes of pressed HMX with distinctive micro-structural characteristics. Direct numerical simulations of shock-loaded synthetic microstructures are performed to calculate the meso-scale reaction rates. For all three classes, the synthetic microstructures capture the effect of morphological uncertainties of real microstructures on the response to shock loading. The calculated reaction rates for different classes also compare well with those of the corresponding real microstructures. Thus, the article demonstrates that machine-generated ensembles of synthetic microstructures can be employed to derive structure–property–performance linkages of a wide class of real pressed energetic materials. The ability to manipulate the synthetic microstructures using deep learning-based approaches then provides an opportunity for material designers to develop and manufacture pressed energetic materials that can yield targeted performance.",
        "doi": "https://doi.org/10.1063/5.0065298",
        "view-link": "https://pubs.aip.org/aip/jap/article/131/5/055905/2836573",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_11_CMWA_2021.jpg",
        "card-heading": "A robust sharp interface based immersed boundary framework for moving body problems with applications to laminar incompressible flows.",
        "author-name": "Seshadri, P. K., and De, A.",
        "year": "2021",
        "citation": "19 citations",
        "tags": ["Sharp interface approach", "Mass conservation", "Spurious oscillations"],
        "category": "Journal",
        "publication-title": "Computers & Mathematics with Applications",
        "description": "This study presents a robust, sharp interface immersed boundary (IBM) framework for moving body problems. The in-house solver makes use of a density-based finite volume framework for solving unsteady, 3D Favre averaged Navier Stokes equation in a generalized curvilinear coordinate system. The immersed boundary formulation is capable of handling arbitrarily complex three-dimensional bodies. The sharp interface approach allows for the exact imposition of boundary conditions at the immersed surface by reconstructing the flow field along its local normal. The implemented reconstruction schemes maintain second-order accuracy. The study focuses on issues of mass conservation and spurious temporal oscillations (pressure as well as force) that the sharp interface IBM approach typically faces when encountering moving body problems. A ghost node-based field extension technique provides an efficient way to improve mass conservation and as a result, reduces not only spurious oscillations but also increases temporal accuracy. Flow past both bluff body (triangular, circular and spherical), as well as streamlined body (airfoil), is presented here as validation studies. The ability of the present formulation to deal with moving body problems in the laminar incompressible flow regime is demonstrated by presenting cases that involve motions such as pitching and in-line oscillation. The predictions are found to be in good agreement with the published results and measurements as well.",
        "doi": "https://doi.org/10.1016/j.camwa.2019.11.020",
        "view-link": "https://www.sciencedirect.com/science/article/pii/S089812211930553X?via%3Dihub",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_13_PF_2020.jpg",
        "card-heading": "Investigation of shock wave interactions involving stationary and moving wedges.",
        "author-name": "Seshadri, P. K., and De, A.",
        "year": "2020",
        "citation": "23 citations",
        "tags": ["Fluid mechanics", "Computational fluid dynamics", "Mach reflection","Shock waves"],
        "category": "Journal",
        "publication-title": "Physics of Fluids",
        "description": "The present study investigates the shock wave interactions involving stationary and moving wedges using a sharp interface immersed boundary method combined with a fifth-order weighted essentially non-oscillatory scheme. Inspired by Schardin’s problem, which involves moving shock interaction with a finite triangular wedge, we study the influence of incident shock Mach numbers and corner angles on the resulting flow physics under both stationary and moving conditions. The present study involves three incident shock Mach numbers (1.3, 1.9, and 2.5) and three corner angles (60°, 90°, and 120°), while its impact on the vorticity production is investigated using the vorticity transport equation, circulation, and rate of circulation production. Furthermore, the results yield that the generation of the vorticity due to the viscous effects is quite dominant compared to the baroclinic or compressibility effects. The moving cases presented involve shock driven wedge problems. The fluid and wedge structure dynamics are coupled using the Newtonian equation. These shock driven wedge cases show that wedge acceleration due to the shock results in a change in reflected wave configuration from single Mach reflection to double Mach reflection. The intermediary state between them, the transition Mach reflection, is also observed in the process. The effect of shock Mach numbers and corner angles on the triple point trajectory, as well as on the drag coefficient, is analyzed in this study.",
        "doi": "https://doi.org/10.1063/5.0020365",
        "view-link": "https://pubs.aip.org/aip/pof/article-abstract/32/9/096110/1061118/Investigation-of-shock-wave-interactions-involving?redirectedFrom=fulltext",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_12_CNF_2020.jpg",
        "card-heading": "A novel sharp interface immersed boundary framework for viscous flow simulations at arbitrary Mach number involving complex and moving boundaries.",
        "author-name": "Seshadri, P. K., and De, A.",
        "year": "2020",
        "citation": "20 citations",
        "tags": ["Sharp interface method", "All-speed flow regimes", "Complex geometries"],
        "category": "Journal",
        "publication-title": "Computers & Fluids",
        "description": "This work presents a robust and efficient sharp interface immersed boundary (IBM) framework, which is applicable for all-speed flow regimes and is capable of handling arbitrarily complex bodies (stationary or moving). The work deploys an in-house, parallel, multi-block structured finite volume flow solver, which employs a 3D unsteady Favre averaged Navier Stokes equations in a generalized curvilinear coordinate system; while we employ a combination of HCIB (Hybrid Cartesian Immersed boundary) method and GC(Ghost-cell) for solution reconstruction near immersed boundary interface. A significant difficulty for these sharp interface approaches is of handling sharp features/edges of complex geometries. In this study, we observe that apart from the need for robust node classification strategy and higher order boundary formulations, the direction in which the reconstruction procedures are performed plays an important role in handling sharp edges. Taking this into account we present a versatile interface tracking procedure based on ray tracing algorithm and a novel three step solution reconstruction procedure that computes pseudo-normals in the regions where the normal is not well-defined and reconstructs the flow field along those directions. We demonstrate that this procedure enables solver to efficiently handle and accurately represent sharp-edged regions. A fifth-order weighted essentially non-oscillatory (WENO) scheme is used for capturing shock-induced discontinuities and complex fluid-solid interactions with high resolution. The developed IBM framework is applied to a wide range of flow phenomena encompassing all-speed regimes (M=0.001 to M = 2.0). A total of seven benchmark cases (three stationary and four moving bodies) are presented involving various geometries (cylinder, airfoil, wedge) and the predictions are found to be in excellent agreement with the published results.",
        "doi": "https://doi.org/10.1016/j.compfluid.2020.104579",
        "view-link": "https://www.sciencedirect.com/science/article/abs/pii/S0045793020301511?via%3Dihub",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_14_JFVIP_2019.jpg",
        "card-heading": "Flow Past Stationary and Oscillating Airfoil at a Low Reynolds Number Using Sharp Interface Immersed-Boundary Approach",
        "author-name": "Seshadri, P. K., and De, A.",
        "year": "2019",
        "citation": "6 citations",
        "tags": ["sharp interface", "immersed-boundary method", "field extension","dynamic stall","leading edge vortex"],
        "category": "Journal",
        "publication-title": "Journal of Flow Visualizations and Image Processing",
        "description": "The present study reports on flow past airfoils (stationary and moving) using a sharp interface immersed-boundary approach. A nonboundary conforming approach like the immersed-boundary method offers a viable alternative over traditional boundary conforming approach by allowing us to model flow past arbitrarily complex shapes, by eliminating the need to regrid the flow domain as the body exhibits motion. We present flow past a NACA 0012 airfoil under stationary conditions as well as exhibiting pitching motion. The evolution of vortex dynamics and wake structures are presented to show that the developed sharp interface immersed-boundary approach captures the flow physics of dynamic stall accurately. Moving body problems involving immersed-boundary approach usually encounter the issues of spurious oscillations and mass conservation. This is handled through a field extension strategy based on a ghost cell approach, which allows for extrapolating the flow field value onto the ghost nodes, ensuring smooth temporal transition as the immersed surface moves through time. The results presented here show excellent agreement with the experimental results found in the literature.",
        "doi": "https://doi.org/10.1615/JFlowVisImageProc.2020030995",
        "view-link": "https://www.dl.begellhouse.com/journals/52b74bd3689ab10b,38e46e5e497ac8cb,41cde98b141a82bb.html",
        "pdf-link": "#"
      }
    },
    {
      "card": {
        "thumbnail": "images/Pub_Journal_15_JFS_2015.jpg",
        "card-heading": "Investigation of flow field of clap & fling motion using Immersed Boundary coupled Lattice Boltzmann Method",
        "author-name": "Seshadri, P. K., De, A., and Das, D",
        "year": "2015",
        "citation": "23 citations",
        "tags": ["Clap and Fling Mechanism", "Immersed Boundary Method (IBM)", "Lattice Boltzmann Method (LBM)", "Kramer Effect"],
        "category": "Journal",
        "publication-title": "Journal of Fluids and Structures",
        "description": "This paper deals with the investigation of flow field due to clap and fling mechanism using immersed boundary coupled with lattice Boltzmann method. The lattice Boltzmann method (LBM), an alternative to Navier–Stokes solver, is used because of its simplicity and computational efficiency in solving complex moving boundary problems. Benchmark problems are simulated to validate the code, which is then used for simulating flow over two elliptic wing of aspect ratio 5 performing clap and fling flapping motion for different flow parameters such as Reynolds number (Re=75, 100, 150), advance ratio (J=10E−3.10E−2,0.2) and frequency (f=0.05 Hz, 0.25 Hz). Numerical simulation is able to capture typical low Reynolds number unsteady phenomena such as, ׳wake vortex wing interaction׳, ׳Kramer effect׳ and ׳delayed stall׳. The results are both qualitatively and quantitatively consistent with experimental observation. The parametric study involving different combinations of Re, f and J depict distinctly different aerodynamic performances providing physical insights into the flow physics. It is observed that a combination of low f, low J and high Re flow results in better aerodynamic performance. Pronounced lift enhancement via leading edge vortices are obtained in unsteady regime (J<1) compared to quasi-steady regime (J>1). The role of leading edge vortices in enhancing lift are investigated by studying the size and strength of these vortices for different flow conditions. For a given Re, the magnitude of maximum lift coefficient decreases with increasing f irrespective of the value of J; while the same is enhanced with the increasing Re.",
        "doi": "https://doi.org/10.1016/j.jfluidstructs.2015.06.008",
        "view-link": "https://www.sciencedirect.com/science/article/abs/pii/S0889974615001383?via%3Dihub",
        "pdf-link": "#"
      }
    }
  ],
  "recent-highlights": {
    "recent-section-title":"Recent Highlight",
    "recent-section-subtitle":"Featured publications representing our latest research breakthroughs",
    "cards":[
    {
      "recent-badge": "Pre-Print 2025",
      "recent-title": "Latent Representation Learning of Multi-scale Thermophysics: Application to Dynamics in Shocked Porous Energetic Material",
      "recent-authors": "Azarfar, S., Choi, J. B., Nguyen, P. C. H., Nguyen, Y. T., Seshadri, P. K., Udaykumar, H.S., and Baek, S.",
      "recent-journal": "International Journal of Multiphase Flow",
      "recent-description": "Multiphase compressible flow systems can exhibit unsteady and fast-transient dynamics, marked by sharp gradients and discontinuities, and material boundaries that interact with the evolving flow. The transient nature of the dynamics presents challenges to employing artificial intelligence (AI) and data-driven models for predicting flow behaviors. In this study, we explore the potential of physics-aware recurrent convolutional neural networks (PARC) to model the spatiotemporal dynamics of multiphase flows in the presence of shocks and reaction fronts. PARC is a neural network model that incorporates the generic form of the diffusion–advection–reaction equation in its network architecture, which mimics the process of solving the governing equations of fluid flows. In contrast to physics-informed machine learning approaches such as physics-informed neural networks (PINNs) where models are trained to directly minimize the residual of governing equations, PARC takes a dynamical systems viewpoint and does not seek to minimize potentially nonconvex and nonlinear loss terms. To assess the ability of PARC to accurately learn and simulate the physics of multiphase flows, we train and test PARC on various flow simulation problems, including the Burgers’ equation, fluid flow behind a cylindrical cross-section, and unsteady shock interactions with a particle at varying Mach numbers. We analyze PARC’s performance and examine sources of error in its prediction, in terms of differentiation and integration schemes and different weighting strategies for the model update. Based on our observations, we discuss PARC’s capabilities and limitations in multiphase flow applications and propose future research directions.",
      "recent-citations": "0 citations",
      "recent-link":"https://arxiv.org/abs/2506.12996"
    },
    {
      "recent-badge": "ICML Conference 2024",
      "recent-title": "PARCv2: Physics-aware recurrent convolutional neural networks for spatiotemporal dynamics modeling.",
      "recent-authors": "Nguyen, P. C. H., Cheng, X., Azarfar, S., Seshadri, P. K., Nguyen, Y. T., Kim, M., Choi, S., Udaykumar, H.S., and Baek, S.",
      "recent-journal": "ICML Conference 2024",
      "recent-description": "we investigate an inductive bias approach that is versatile and generalizable to model generic nonlinear field evolution problems. Our study focuses on the recent physics-aware recurrent convolutions (PARC), which incorporates a differentiator-integrator architecture that inductively models the spatiotemporal dynamics of generic physical systems. We extend the capabilities of PARC to simulate unsteady, transient, and advection-dominant systems. The extended model, referred to as PARCv2, is equipped with differential operators to model advection-reaction-diffusion equations, as well as a hybrid integral solver for stable, long-time predictions.",
      "recent-citations": "8 citations",
      "recent-link":"https://arxiv.org/abs/2402.12503"
    },
    {
      "recent-badge": "Journal",
      "recent-title": "Physics-aware recurrent convolutional neural networks for modeling multiphase compressible flows.",
      "recent-authors": "Cheng, X., Nguyen, P. C. H., Seshadri, P. K., Verma, M. Gray, Z., Beerman, J., Udaykumar, H.S., and Baek, S.",
      "recent-journal": "International Journal of Multiphase Flow",
      "recent-description": "Multiphase compressible flow systems can exhibit unsteady and fast-transient dynamics, marked by sharp gradients and discontinuities, and material boundaries that interact with the evolving flow. The transient nature of the dynamics presents challenges to employing artificial intelligence (AI) and data-driven models for predicting flow behaviors. In this study, we explore the potential of physics-aware recurrent convolutional neural networks (PARC) to model the spatiotemporal dynamics of multiphase flows in the presence of shocks and reaction fronts. PARC is a neural network model that incorporates the generic form of the diffusion–advection–reaction equation in its network architecture, which mimics the process of solving the governing equations of fluid flows. In contrast to physics-informed machine learning approaches such as physics-informed neural networks (PINNs) where models are trained to directly minimize the residual of governing equations, PARC takes a dynamical systems viewpoint and does not seek to minimize potentially nonconvex and nonlinear loss terms. To assess the ability of PARC to accurately learn and simulate the physics of multiphase flows, we train and test PARC on various flow simulation problems, including the Burgers’ equation, fluid flow behind a cylindrical cross-section, and unsteady shock interactions with a particle at varying Mach numbers. We analyze PARC’s performance and examine sources of error in its prediction, in terms of differentiation and integration schemes and different weighting strategies for the model update. Based on our observations, we discuss PARC’s capabilities and limitations in multiphase flow applications and propose future research directions.",
      "recent-citations": "12 citations",
      "recent-link":"https://www.sciencedirect.com/science/article/pii/S030193222400154X?via%3Dihub"
    }  
  ]}
}
